zhmaksim/NUCLEO-H7S3L8/Drivers/HAL/stm32h7s3xx_hal_rcc.c
/**
 * Copyright (C) 2025 zhmaksim <zhiharev.maxim.alexandrovich@yandex.ru>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program. If not, see <https://www.gnu.org/licenses/>.
 */

/* Includes ---------------------------------------------------------------- */

#include "stm32h7s3xx_hal_rcc.h"
#include "stm32h7s3xx_hal_systick.h"

/* Private macros ---------------------------------------------------------- */

/* Private constants ------------------------------------------------------- */

#define HAL_RCC_HSERDY_TIMEOUT      100

#define HAL_RCC_LSERDY_TIMEOUT      5000

/* Private types ----------------------------------------------------------- */

/* Private variables ------------------------------------------------------- */

/* Обработчик SysTick */
extern struct systick_handle systick;

/* Private function prototypes --------------------------------------------- */

static void hal_rcc_setup_hse(rcc_t *instance, uint8_t state);

static void hal_rcc_setup_hse_css(rcc_t *instance, uint8_t state);

static void hal_rcc_setup_pll1(rcc_t *instance, uint8_t state);

static void hal_rcc_setup_pll2(rcc_t *instance, uint8_t state);

static void hal_rcc_setup_pll3(rcc_t *instance, uint8_t state);

static void hal_rcc_setup_pll_clock_source(rcc_t *instance, uint8_t clksource);

static void hal_rcc_setup_pll_divm1(rcc_t *instance, uint8_t div);

static void hal_rcc_setup_pll_divm2(rcc_t *instance, uint8_t div);

static void hal_rcc_setup_pll_divm3(rcc_t *instance, uint8_t div);

static void hal_rcc_pll1_init(rcc_t *instance, const struct rcc_pll *pll);

static void hal_rcc_pll1_setup_vco(rcc_t *instance, uint8_t vco);

static void hal_rcc_pll1_setup_rge(rcc_t *instance, uint8_t rge);

static void hal_rcc_pll1_setup_divn(rcc_t *instance, uint16_t div);

static void hal_rcc_pll1_setup_divp(rcc_t *instance, uint16_t div);

static void hal_rcc_pll1_setup_divq(rcc_t *instance, uint16_t div);

static void hal_rcc_pll1_setup_divr(rcc_t *instance, uint16_t div);

static void hal_rcc_pll1_setup_divs(rcc_t *instance, uint16_t div);

static void hal_rcc_pll1_setup_fractional(rcc_t *instance, uint16_t fracn);

static void hal_rcc_pll2_init(rcc_t *instance, const struct rcc_pll *pll);

static void hal_rcc_pll2_setup_vco(rcc_t *instance, uint8_t vco);

static void hal_rcc_pll2_setup_rge(rcc_t *instance, uint8_t rge);

static void hal_rcc_pll2_setup_divn(rcc_t *instance, uint16_t div);

static void hal_rcc_pll2_setup_divp(rcc_t *instance, uint16_t div);

static void hal_rcc_pll2_setup_divq(rcc_t *instance, uint16_t div);

static void hal_rcc_pll2_setup_divr(rcc_t *instance, uint16_t div);

static void hal_rcc_pll2_setup_divs(rcc_t *instance, uint16_t div);

static void hal_rcc_pll2_setup_divt(rcc_t *instance, uint16_t div);

static void hal_rcc_pll2_setup_fractional(rcc_t *instance, uint16_t fracn);

static void hal_rcc_pll3_init(rcc_t *instance, const struct rcc_pll *pll);

static void hal_rcc_pll3_setup_vco(rcc_t *instance, uint8_t vco);

static void hal_rcc_pll3_setup_rge(rcc_t *instance, uint8_t rge);

static void hal_rcc_pll3_setup_divn(rcc_t *instance, uint16_t div);

static void hal_rcc_pll3_setup_divp(rcc_t *instance, uint16_t div);

static void hal_rcc_pll3_setup_divq(rcc_t *instance, uint16_t div);

static void hal_rcc_pll3_setup_divr(rcc_t *instance, uint16_t div);

static void hal_rcc_pll3_setup_divs(rcc_t *instance, uint16_t div);

static void hal_rcc_pll3_setup_fractional(rcc_t *instance, uint16_t fracn);

static void hal_rcc_setup_cpu_div(rcc_t *instance, uint8_t div);

static void hal_rcc_setup_bus_div(rcc_t *instance, uint8_t div);

static void hal_rcc_setup_apb1_div(rcc_t *instance, uint8_t div);

static void hal_rcc_setup_apb2_div(rcc_t *instance, uint8_t div);

static void hal_rcc_setup_apb4_div(rcc_t *instance, uint8_t div);

static void hal_rcc_setup_apb5_div(rcc_t *instance, uint8_t div);

static void hal_rcc_setup_cpu_clock_source(rcc_t *instance, uint8_t clksource);

/* Private user code ------------------------------------------------------- */

/**
 * @brief           Инициализировать RCC
 *
 * @param[in]       handle: Указатель на структуру данных обработчика RCC
 */
void hal_rcc_init(struct rcc_handle *handle)
{
    assert(handle != NULL);
    assert(handle->instance != NULL);

    /* Настроить HSE */
    hal_rcc_setup_hse(handle->instance, handle->init.hse_enable);
    hal_rcc_setup_hse_css(handle->instance, handle->init.hse_css_enable);

    /* Настроить PLL */
    hal_rcc_setup_pll1(handle->instance, DISABLE);
    hal_rcc_setup_pll2(handle->instance, DISABLE);
    hal_rcc_setup_pll3(handle->instance, DISABLE);
    hal_rcc_setup_pll_clock_source(handle->instance, handle->init.pll_clksource);
    hal_rcc_setup_pll_divm1(handle->instance, handle->init.pll_divm1);
    hal_rcc_setup_pll_divm2(handle->instance, handle->init.pll_divm2);
    hal_rcc_setup_pll_divm3(handle->instance, handle->init.pll_divm3);
    hal_rcc_pll1_init(handle->instance, (struct rcc_pll *) &handle->init.pll1);
    hal_rcc_pll2_init(handle->instance, (struct rcc_pll *) &handle->init.pll2);
    hal_rcc_pll3_init(handle->instance, (struct rcc_pll *) &handle->init.pll3);

    /* Настроить тактирование CPU, BUS, CPU CLKSOURCE */
    hal_rcc_setup_cpu_div(handle->instance, handle->init.cpu_div);
    hal_rcc_setup_bus_div(handle->instance, handle->init.bus_div);
    hal_rcc_setup_apb1_div(handle->instance, handle->init.apb1_div);
    hal_rcc_setup_apb2_div(handle->instance, handle->init.apb2_div);
    hal_rcc_setup_apb4_div(handle->instance, handle->init.apb4_div);
    hal_rcc_setup_apb5_div(handle->instance, handle->init.apb5_div);
    hal_rcc_setup_cpu_clock_source(handle->instance, handle->init.cpu_clksource);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить состояние HSE
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       state: Состояние @ref hal_state_t
 */
static void hal_rcc_setup_hse(rcc_t *instance, uint8_t state)
{
    MODIFY_REG(instance->CR,
               RCC_CR_HSEON_Msk,
               state << RCC_CR_HSEON_Pos);

    if (state == HAL_ENABLE) {
        uint32_t tickstart = hal_systick_tick(&systick);

