zhmaksim/NUCLEO-H7S3L8/Drivers/HAL/stm32h7s3xx_hal_rcc.c
        while (!READ_BIT(instance->CR, RCC_CR_HSERDY_Msk)) {
            if (hal_systick_tick(&systick) - tickstart >= HAL_RCC_HSERDY_TIMEOUT) {
                hal_error();
            }
        }
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить состояние HSE CSS
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       state: Состояние @ref hal_state_t
 */
static void hal_rcc_setup_hse_css(rcc_t *instance, uint8_t state)
{
    MODIFY_REG(instance->CR,
               RCC_CR_HSECSSON_Msk,
               state << RCC_CR_HSECSSON_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить состояние PLL1
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       state: Состояние @ref hal_state_t
 */
static void hal_rcc_setup_pll1(rcc_t *instance, uint8_t state)
{
    MODIFY_REG(instance->CR,
               RCC_CR_PLL1ON_Msk,
               state << RCC_CR_PLL1ON_Pos);

    if (state == HAL_ENABLE) {
        while (!READ_BIT(instance->CR, RCC_CR_PLL1RDY_Msk)) {
            continue;
        }
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить состояние PLL2
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       state: Состояние @ref hal_state_t
 */
static void hal_rcc_setup_pll2(rcc_t *instance, uint8_t state)
{
    MODIFY_REG(instance->CR,
               RCC_CR_PLL2ON_Msk,
               state << RCC_CR_PLL2ON_Pos);

    if (state == HAL_ENABLE) {
        while (!READ_BIT(instance->CR, RCC_CR_PLL2RDY_Msk)) {
            continue;
        }
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить состояние PLL3
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       state: Состояние @ref hal_state_t
 */
static void hal_rcc_setup_pll3(rcc_t *instance, uint8_t state)
{
    MODIFY_REG(instance->CR,
               RCC_CR_PLL3ON_Msk,
               state << RCC_CR_PLL3ON_Pos);

    if (state == HAL_ENABLE) {
        while (!READ_BIT(instance->CR, RCC_CR_PLL3RDY_Msk)) {
            continue;
        }
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить источник тактирования PLL
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       clksource: Источник тактирования PLL @ref enum rcc_pll_clock_source
 */
static void hal_rcc_setup_pll_clock_source(rcc_t *instance, uint8_t clksource)
{
    MODIFY_REG(instance->PLLCKSELR,
               RCC_PLLCKSELR_PLLSRC_Msk,
               clksource << RCC_PLLCKSELR_PLLSRC_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить значение делителя DIVM1
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Делитель
 */
static void hal_rcc_setup_pll_divm1(rcc_t *instance, uint8_t div)
{
    MODIFY_REG(instance->PLLCKSELR,
               RCC_PLLCKSELR_DIVM1_Msk,
               div << RCC_PLLCKSELR_DIVM1_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить значение делителя DIVM2
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Делитель
 */
static void hal_rcc_setup_pll_divm2(rcc_t *instance, uint8_t div)
{
    MODIFY_REG(instance->PLLCKSELR,
               RCC_PLLCKSELR_DIVM2_Msk,
               div << RCC_PLLCKSELR_DIVM2_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить значение делителя DIVM3
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Делитель
 */
static void hal_rcc_setup_pll_divm3(rcc_t *instance, uint8_t div)
{
    MODIFY_REG(instance->PLLCKSELR,
               RCC_PLLCKSELR_DIVM3_Msk,
               div << RCC_PLLCKSELR_DIVM3_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Инициализировать PLL1
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       pll: Указатель на структуру данных PLL
 */
static void hal_rcc_pll1_init(rcc_t *instance, const struct rcc_pll *pll)
{
    if (pll->enable == HAL_DISABLE) {
        return;
    }

    hal_rcc_pll1_setup_vco(instance, pll->vco);
    hal_rcc_pll1_setup_rge(instance, pll->rge);
    hal_rcc_pll1_setup_divn(instance, pll->divn);
    hal_rcc_pll1_setup_divp(instance, pll->divp);
    hal_rcc_pll1_setup_divq(instance, pll->divq);
    hal_rcc_pll1_setup_divr(instance, pll->divr);
    hal_rcc_pll1_setup_divs(instance, pll->divs);
    hal_rcc_pll1_setup_fractional(instance, pll->fracn);

    hal_rcc_setup_pll1(instance, HAL_ENABLE);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL1 VCO
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       vco: Диапазон VCO @ref enum rcc_pll_vco
 */
static void hal_rcc_pll1_setup_vco(rcc_t *instance, uint8_t vco)
{
    MODIFY_REG(instance->PLLCFGR,
               RCC_PLLCFGR_PLL1VCOSEL_Msk,
               vco << RCC_PLLCFGR_PLL1VCOSEL_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL1 RGE
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       rge: Диапазон RGE @ref enum rcc_pll_rge
 */
static void hal_rcc_pll1_setup_rge(rcc_t *instance, uint8_t rge)
{
    MODIFY_REG(instance->PLLCFGR,
               RCC_PLLCFGR_PLL1RGE_Msk,
               rge << RCC_PLLCFGR_PLL1RGE_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL1 DIVN
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя
 */
static void hal_rcc_pll1_setup_divn(rcc_t *instance, uint16_t div)
{
    if (div < 8 || div > 420) {
        return;
    }

    MODIFY_REG(instance->PLL1DIVR1,
               RCC_PLL1DIVR1_DIVN_Msk,
               (div - 1) << RCC_PLL1DIVR1_DIVN_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL1 DIVP
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя
 */
static void hal_rcc_pll1_setup_divp(rcc_t *instance, uint16_t div)
{
    if (div == 0 || div == 2 || div > 128) {
        CLEAR_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL1PEN_Msk);
    } else {
        SET_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL1PEN_Msk);

        MODIFY_REG(instance->PLL1DIVR1,
                   RCC_PLL1DIVR1_DIVP_Msk,
                   (div - 1) << RCC_PLL1DIVR1_DIVP_Pos);
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL1 DIVQ
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя
 */
static void hal_rcc_pll1_setup_divq(rcc_t *instance, uint16_t div)
{
    if (div == 0 || div > 128) {
        CLEAR_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL1QEN_Msk);
    } else {
        SET_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL1QEN_Msk);

        MODIFY_REG(instance->PLL1DIVR1,
                   RCC_PLL1DIVR1_DIVQ_Msk,
                   (div - 1) << RCC_PLL1DIVR1_DIVQ_Pos);
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL1 DIVR
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя
 */
static void hal_rcc_pll1_setup_divr(rcc_t *instance, uint16_t div)
{
    if (div == 0 || div > 128) {
        CLEAR_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL1REN_Msk);
    } else {
        SET_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL1REN_Msk);

        MODIFY_REG(instance->PLL1DIVR1,
                   RCC_PLL1DIVR1_DIVR_Msk,
                   (div - 1) << RCC_PLL1DIVR1_DIVR_Pos);
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL1 DIVS
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя
 */
static void hal_rcc_pll1_setup_divs(rcc_t *instance, uint16_t div)
{
    if (div == 0 || div > 8) {
        CLEAR_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL1SEN_Msk);
    } else {
        SET_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL1SEN_Msk);

        MODIFY_REG(instance->PLL1DIVR2,
                   RCC_PLL1DIVR2_DIVS_Msk,
                   (div - 1) << RCC_PLL1DIVR2_DIVS_Pos);
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL1 fractional
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       fracn: Значение fractional
 */
static void hal_rcc_pll1_setup_fractional(rcc_t *instance, uint16_t fracn)
{
    CLEAR_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL1FRACEN_Msk);

