zhmaksim/NUCLEO-H7S3L8/Drivers/HAL/stm32h7s3xx_hal_rcc.c
    MODIFY_REG(instance->PLL1FRACR,
               RCC_PLL1FRACR_FRACN_Msk,
               fracn << RCC_PLL1FRACR_FRACN_Pos);

    SET_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL1FRACEN_Msk);

    uint32_t tickstart = hal_systick_tick(&systick);
    while (hal_systick_tick(&systick) - tickstart < 1) {
        continue;
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Инициализировать PLL2
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       pll: Указатель на структуру данных PLL
 */
static void hal_rcc_pll2_init(rcc_t *instance, const struct rcc_pll *pll)
{
    if (pll->enable == HAL_DISABLE) {
        return;
    }

    hal_rcc_pll2_setup_vco(instance, pll->vco);
    hal_rcc_pll2_setup_rge(instance, pll->rge);
    hal_rcc_pll2_setup_divn(instance, pll->divn);
    hal_rcc_pll2_setup_divp(instance, pll->divp);
    hal_rcc_pll2_setup_divq(instance, pll->divq);
    hal_rcc_pll2_setup_divr(instance, pll->divr);
    hal_rcc_pll2_setup_divs(instance, pll->divs);
    hal_rcc_pll2_setup_divt(instance, pll->divt);
    hal_rcc_pll2_setup_fractional(instance, pll->fracn);

    hal_rcc_setup_pll2(instance, HAL_ENABLE);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL2 VCO
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       vco: Диапазон VCO @ref enum rcc_pll_vco
 */
static void hal_rcc_pll2_setup_vco(rcc_t *instance, uint8_t vco)
{
    MODIFY_REG(instance->PLLCFGR,
               RCC_PLLCFGR_PLL2VCOSEL_Msk,
               vco << RCC_PLLCFGR_PLL2VCOSEL_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL2 RGE
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       rge: Диапазон RGE @ref enum rcc_pll_rge
 */
static void hal_rcc_pll2_setup_rge(rcc_t *instance, uint8_t rge)
{
    MODIFY_REG(instance->PLLCFGR,
               RCC_PLLCFGR_PLL2RGE_Msk,
               rge << RCC_PLLCFGR_PLL2RGE_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL2 DIVN
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя
 */
static void hal_rcc_pll2_setup_divn(rcc_t *instance, uint16_t div)
{
    if (div < 8 || div > 420) {
        return;
    }

    MODIFY_REG(instance->PLL2DIVR1,
               RCC_PLL2DIVR1_DIVN_Msk,
               (div - 1) << RCC_PLL2DIVR1_DIVN_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL2 DIVP
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя
 */
static void hal_rcc_pll2_setup_divp(rcc_t *instance, uint16_t div)
{
    if (div == 0 || div == 2 || div > 128) {
        CLEAR_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL2PEN_Msk);
    } else {
        SET_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL2PEN_Msk);

        MODIFY_REG(instance->PLL2DIVR1,
                   RCC_PLL2DIVR1_DIVP_Msk,
                   (div - 1) << RCC_PLL2DIVR1_DIVP_Pos);
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL2 DIVQ
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя
 */
static void hal_rcc_pll2_setup_divq(rcc_t *instance, uint16_t div)
{
    if (div == 0 || div > 128) {
        CLEAR_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL2QEN_Msk);
    } else {
        SET_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL2QEN_Msk);

        MODIFY_REG(instance->PLL2DIVR1,
                   RCC_PLL2DIVR1_DIVQ_Msk,
                   (div - 1) << RCC_PLL2DIVR1_DIVQ_Pos);
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL2 DIVR
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя
 */
static void hal_rcc_pll2_setup_divr(rcc_t *instance, uint16_t div)
{
    if (div == 0 || div > 128) {
        CLEAR_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL2REN_Msk);
    } else {
        SET_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL2REN_Msk);

        MODIFY_REG(instance->PLL2DIVR1,
                   RCC_PLL2DIVR1_DIVR_Msk,
                   (div - 1) << RCC_PLL2DIVR1_DIVR_Pos);
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL2 DIVS
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя
 */
static void hal_rcc_pll2_setup_divs(rcc_t *instance, uint16_t div)
{
    if (div == 0 || div > 8) {
        CLEAR_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL2SEN_Msk);
    } else {
        SET_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL2SEN_Msk);

        MODIFY_REG(instance->PLL2DIVR2,
                   RCC_PLL2DIVR2_DIVS_Msk,
                   (div - 1) << RCC_PLL2DIVR2_DIVS_Pos);
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL2 DIVT
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя
 */
static void hal_rcc_pll2_setup_divt(rcc_t *instance, uint16_t div)
{
    if (div == 0 || div > 8) {
        CLEAR_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL2TEN_Msk);
    } else {
        SET_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL2TEN_Msk);

        MODIFY_REG(instance->PLL2DIVR2,
                   RCC_PLL2DIVR2_DIVT_Msk,
                   (div - 1) << RCC_PLL2DIVR2_DIVT_Pos);
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL2 fractional
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       fracn: Значение fractional
 */
static void hal_rcc_pll2_setup_fractional(rcc_t *instance, uint16_t fracn)
{
    CLEAR_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL2FRACEN_Msk);

    MODIFY_REG(instance->PLL2FRACR,
               RCC_PLL2FRACR_FRACN_Msk,
               fracn << RCC_PLL2FRACR_FRACN_Pos);

    SET_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL2FRACEN_Msk);

