zhmaksim/NUCLEO-H7S3L8/Drivers/HAL/stm32h7s3xx_hal_rcc.c
    uint32_t tickstart = hal_systick_tick(&systick);
    while (hal_systick_tick(&systick) - tickstart < 1) {
        continue;
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Инициализировать PLL3
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       pll: Указатель на структуру данных PLL
 */
static void hal_rcc_pll3_init(rcc_t *instance, const struct rcc_pll *pll)
{
    if (pll->enable == HAL_DISABLE) {
        return;
    }

    hal_rcc_pll3_setup_vco(instance, pll->vco);
    hal_rcc_pll3_setup_rge(instance, pll->rge);
    hal_rcc_pll3_setup_divn(instance, pll->divn);
    hal_rcc_pll3_setup_divp(instance, pll->divp);
    hal_rcc_pll3_setup_divq(instance, pll->divq);
    hal_rcc_pll3_setup_divr(instance, pll->divr);
    hal_rcc_pll3_setup_divs(instance, pll->divs);
    hal_rcc_pll3_setup_fractional(instance, pll->fracn);

    hal_rcc_setup_pll3(instance, HAL_ENABLE);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL3 VCO
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       vco: Диапазон VCO @ref enum rcc_pll_vco
 */
static void hal_rcc_pll3_setup_vco(rcc_t *instance, uint8_t vco)
{
    MODIFY_REG(instance->PLLCFGR,
               RCC_PLLCFGR_PLL3VCOSEL_Msk,
               vco << RCC_PLLCFGR_PLL3VCOSEL_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL3 RGE
 *
 * @param[in]       instance Указатель на структуру данных RCC
 * @param[in]       rge: Диапазон RGE @ref enum rcc_pll_rge
 */
static void hal_rcc_pll3_setup_rge(rcc_t *instance, uint8_t rge)
{
    MODIFY_REG(instance->PLLCFGR,
               RCC_PLLCFGR_PLL3RGE_Msk,
               rge << RCC_PLLCFGR_PLL3RGE_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL3 DIVN
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя
 */
static void hal_rcc_pll3_setup_divn(rcc_t *instance, uint16_t div)
{
    if (div < 8 || div > 420) {
        return;
    }

    MODIFY_REG(instance->PLL3DIVR1,
               RCC_PLL3DIVR1_DIVN_Msk,
               (div - 1) << RCC_PLL3DIVR1_DIVN_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL3 DIVP
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя
 */
static void hal_rcc_pll3_setup_divp(rcc_t *instance, uint16_t div)
{
    if (div == 0 || div == 2 || div > 128) {
        CLEAR_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL3PEN_Msk);
    } else {
        SET_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL3PEN_Msk);

        MODIFY_REG(instance->PLL3DIVR1,
                   RCC_PLL3DIVR1_DIVP_Msk,
                   (div - 1) << RCC_PLL3DIVR1_DIVP_Pos);
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL3 DIVQ
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя
 */
static void hal_rcc_pll3_setup_divq(rcc_t *instance, uint16_t div)
{
    if (div == 0 || div > 128) {
        CLEAR_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL3QEN_Msk);
    } else {
        SET_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL3QEN_Msk);

        MODIFY_REG(instance->PLL3DIVR1,
                   RCC_PLL3DIVR1_DIVQ_Msk,
                   (div - 1) << RCC_PLL3DIVR1_DIVQ_Pos);
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL3 DIVR
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя
 */
static void hal_rcc_pll3_setup_divr(rcc_t *instance, uint16_t div)
{
    if (div == 0 || div > 128) {
        CLEAR_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL3REN_Msk);
    } else {
        SET_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL3REN_Msk);

        MODIFY_REG(instance->PLL3DIVR1,
                   RCC_PLL3DIVR1_DIVR_Msk,
                   (div - 1) << RCC_PLL3DIVR1_DIVR_Pos);
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL3 DIVS
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя
 */
static void hal_rcc_pll3_setup_divs(rcc_t *instance, uint16_t div)
{
    if (div == 0 || div > 8) {
        CLEAR_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL3SEN_Msk);
    } else {
        SET_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL3SEN_Msk);

        MODIFY_REG(instance->PLL3DIVR2,
                   RCC_PLL3DIVR2_DIVS_Msk,
                   (div - 1) << RCC_PLL3DIVR2_DIVS_Pos);
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить PLL3 fractional
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       fracn: Значение fractional
 */
static void hal_rcc_pll3_setup_fractional(rcc_t *instance, uint16_t fracn)
{
    CLEAR_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL3FRACEN_Msk);

    MODIFY_REG(instance->PLL3FRACR,
               RCC_PLL3FRACR_FRACN_Msk,
               fracn << RCC_PLL3FRACR_FRACN_Pos);

    SET_BIT(instance->PLLCFGR, RCC_PLLCFGR_PLL3FRACEN_Msk);

    uint32_t tickstart = hal_systick_tick(&systick);
    while (hal_systick_tick(&systick) - tickstart < 1) {
        continue;
    }
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить делитель CPU
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя @ref enum rcc_cpu_div
 */
static void hal_rcc_setup_cpu_div(rcc_t *instance, uint8_t div)
{
    MODIFY_REG(instance->CDCFGR,
               RCC_CDCFGR_CPRE_Msk,
               div << RCC_CDCFGR_CPRE_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить делитель BUS
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя @ref enum rcc_bus_div
 */
static void hal_rcc_setup_bus_div(rcc_t *instance, uint8_t div)
{
    MODIFY_REG(instance->BMCFGR,
               RCC_BMCFGR_BMPRE_Msk,
               div << RCC_BMCFGR_BMPRE_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить делитель APB1
 *
 * @param[in]       instance Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя @ref enum rcc_apb_div
 */
static void hal_rcc_setup_apb1_div(rcc_t *instance, uint8_t div)
{
    MODIFY_REG(instance->APBCFGR,
               RCC_APBCFGR_PPRE1_Msk,
               div << RCC_APBCFGR_PPRE1_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить делитель APB2
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя @ref enum rcc_apb_div
 */
static void hal_rcc_setup_apb2_div(rcc_t *instance, uint8_t div)
{
    MODIFY_REG(instance->APBCFGR,
               RCC_APBCFGR_PPRE2_Msk,
               div << RCC_APBCFGR_PPRE2_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить делитель APB4
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя @ref enum rcc_apb_div
 */
static void hal_rcc_setup_apb4_div(rcc_t *instance, uint8_t div)
{
    MODIFY_REG(instance->APBCFGR,
               RCC_APBCFGR_PPRE4_Msk,
               div << RCC_APBCFGR_PPRE4_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить делитель APB5
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       div: Значение делителя @ref enum rcc_apb_div
 */
static void hal_rcc_setup_apb5_div(rcc_t *instance, uint8_t div)
{
    MODIFY_REG(instance->APBCFGR,
               RCC_APBCFGR_PPRE5_Msk,
               div << RCC_APBCFGR_PPRE5_Pos);
}
/* ------------------------------------------------------------------------- */

/**
 * @brief           Установить источник тактирования CPU
 *
 * @param[in]       instance: Указатель на структуру данных RCC
 * @param[in]       clksource: Источник тактирования @ref enum rcc_cpu_clock_source
 */
static void hal_rcc_setup_cpu_clock_source(rcc_t *instance, uint8_t clksource)
{
    MODIFY_REG(instance->CFGR,
               RCC_CFGR_SW_Msk,
               clksource << RCC_CFGR_SW_Pos);

    while (READ_BIT(instance->CFGR, RCC_CFGR_SWS_Msk) !=
            (clksource << RCC_CFGR_SWS_Pos)) {
        continue;
    }
}
/* ------------------------------------------------------------------------- */
